yogiD/RAK8212-itracker-firmware-based-on-nRF5SDK15.0.0-with-DFU/src/itracker/ble_peripheral/itracker/main.c
    *p_erase_bonds = (startup_event == BSP_EVENT_CLEAR_BONDING_DATA);
}


/**@brief Function for initializing the nrf log module.
 */
static void log_init(void)
{
    ret_code_t err_code = NRF_LOG_INIT(NULL);
    APP_ERROR_CHECK(err_code);

    NRF_LOG_DEFAULT_BACKENDS_INIT();
}


/**@brief Function for placing the application in low power state while waiting for events.
 */
static void power_manage(void)
{
    uint32_t err_code = sd_app_evt_wait();
    APP_ERROR_CHECK(err_code);
}

/*----------------------------iTracker application-------------------------------*/
#define LIS3DH_TEST
#define LIS2MDL_TEST
#define BEM280_TEST
#define OPT3001_TEST
#define GSM_TEST

tracker_data_t tracker_data;
char post_data[1024]={0};
uint8_t gsm_started = 0;


#ifdef GSM_TEST

#define  DEST_DOMAIN              "track.vizisens.com"
#define  DEST_PORT                3003//(80)  //
#define  DEST_URL									"itrack\0"
#define  POST_FORMAT 				\
				"{\r\n"							\
				"\"temp\" : %.2f,\r\n"				\
				"\"humi\" : %.2f,\r\n"				\
				"\"press\" : %.2f,\r\n"				\
				"\"light\" : %.2f,\r\n"				\
				"\"lati\" : %.2f,\r\n"\
				"\"longi\" : %.2f,\r\n"\
				"\"X\" : %d,\r\n"				\
				"\"Y\" : %d,\r\n"		\
				"\"Z\" : %d,\r\n"			\
				"\"m_x\" : %.2f,\r\n"				\
				"\"m_y\" : %.2f,\r\n"\
				"\"m_z\" : %.2f\r\n"\
				"}\r\n"

	
int GsmInit()
{
    //int  retavl;
    int time_count;
		
    DPRINTF(LOG_INFO,"check auto baud\r\n");
    /*module init ,check is auto baud,if auto,config to 115200 baud.*/ 
    Gsm_CheckAutoBaud();
    
    DPRINTF(LOG_INFO,"set echo\r\n");
    /*isable cmd echo*/
    Gsm_SetEchoCmd(0);
    
    DPRINTF(LOG_INFO,"check sim card\r\n");
    /*check SIM Card status,if not ready,retry 60s,return*/
    time_count=0;
    while((Gsm_CheckSimCmd()<0))
    {
        delay_ms(GSM_CHECKSIM_RETRY_TIME);
               
        if(++time_count>GSM_CHECKSIM_RETRY_NUM)
        {
            DPRINTF(LOG_WARN,"check sim card timeout\r\n");
            return -1;
        }
    }

		DPRINTF(LOG_INFO,"Test with Hologram on China Mobile\r\n");
		
		time_count=0;
		Gsm_test_hologram();

//    DPRINTF(LOG_INFO,"check network\r\n");
//    /*check Network register status,if not ready,retry 60s,return*/
//    time_count=0;
//    while((Gsm_CheckNetworkCmd()<0))
//    {
//        delay_ms(GSM_CHECKSIM_RETRY_TIME);
//        //delay_ms(300);     
//        if(++time_count>GSM_CHECKSIM_RETRY_NUM)
//        {
//            DPRINTF(LOG_WARN,"check network timeout\r\n");
//            return -1;
//        }
//    }

//    DPRINTF(LOG_INFO,"check GPRS\r\n");
//    /*check GPRS  status,if not ready,retry 60s,return*/
//    time_count=0;
//    while((Gsm_CheckGPRSCmd()<0))
//    {
//        delay_ms(GSM_CHECKSIM_RETRY_TIME);
//               
//        if(++time_count>GSM_CHECKSIM_RETRY_NUM)
//        {
//            DPRINTF(LOG_WARN,"check GPRS timeout\r\n");
//            return -1;
//        }
//    }
#if defined (BC95)
	DPRINTF(LOG_INFO,"check con status\r\n");
    /*check GPRS  status,if not ready,retry 60s,return*/
    time_count=0;
    while((Gsm_CheckConStatusCmd()<0))
    {
        delay_ms(GSM_CHECKSIM_RETRY_TIME);
               
        if(++time_count>GSM_CHECKSIM_RETRY_NUM)
        {
            DPRINTF(LOG_WARN,"check GPRS timeout\r\n");
            return -1;
        }
    }
		DPRINTF(LOG_INFO,"BC95 Connected\r\n");
#endif
#if defined (M35)		
    /*Set Context*/
		DPRINTF(LOG_INFO,"set context 0\r\n");
    Gsm_SetContextCmd();
   
    /*Set dns mode 1, domain*/
		//DPRINTF(LOG_INFO,"set dns mode\r\n");
    Gsm_SetDnsModeCmd();
    /*Set qi send echo 0*/
    //Gsm_SetSdEchoCmd();
		/*Set auto reply*/
		//DPRINTF(LOG_INFO,"set auto reply mode\r\n");
		Gsm_SetAtsEnCmd();

    DPRINTF(LOG_INFO,"check GSM Network ok!!\r\n");
#endif
    int rssi=0;
    rssi= Gsm_GetRssiCmd();
    
    DPRINTF(LOG_INFO, "rssi=%d\r\n",rssi);
    
	return 0;
}


				
int Gsm_HttpPost(uint8_t* data, uint16_t len)
{ 
    int        ret = -1;
    uint16_t   httpLen = 0;
    uint8_t*   http_buf = NULL; 

    ret = Gsm_OpenSocketCmd(GSM_TCP_TYPE, DEST_DOMAIN, DEST_PORT);
    if(ret != 0)
    {
			  Gsm_CloseSocketCmd(); 
        return -1; 
    }
    
    http_buf = malloc(256);
    if(http_buf == NULL)
    {
       DPRINTF(LOG_INFO, "\r\n-----http_buf malloc 256 fail!!!-----\r\n");
       return -1;
    }
    
    httpLen =sprintf((char *)http_buf,
                     "POST /%s HTTP/1.1\r\n"
                     "Host: %s\r\n"
                     "Content-Length: %d\r\n"
                     "Content-Type: application/json\r\n\r\n",
                     DEST_URL, DEST_DOMAIN, len);
    
    
    ret =Gsm_SendDataCmd((char *)http_buf,httpLen); 
    DPRINTF(LOG_DEBUG, "%s", http_buf);
    ret =Gsm_SendDataCmd((char *)data,len); 
    DPRINTF(LOG_DEBUG, "%s", data);
    if (ret < 0) {
      DPRINTF(LOG_ERROR, "Gsm_HttpPost send fail...\r\n");
      free(http_buf);
      Gsm_CloseSocketCmd();
      return ret;   
    }
    
    free(http_buf);
    return ret;
}


int Gsm_HttpRsp(void)
{
    uint16_t   read_len; 
    char*      http_RecvBuf =NULL;
    int        ret = -1;
        
    http_RecvBuf = malloc(1024);
    if(http_RecvBuf == NULL)
    {
       DPRINTF(LOG_INFO, "\r\n-----http_RecvBuf malloc 1024 fail!!!-----\r\n");
       return -1;
    }
     
		read_len = Gsm_RecvData(http_RecvBuf, 5000);//5 s 
		//DPRINTF(LOG_DEBUG, "%s", http_RecvBuf);
		if(read_len > 0) 
		{
				DPRINTF(LOG_DEBUG, "Gsm_HttpRsp response len=%d\r\n", read_len);
		}
    free(http_RecvBuf);
    Gsm_CloseSocketCmd(); 
	
    return ret;
}
#endif

void start_collect_data()
{
		int ret;
#ifdef BEM280_TEST
		get_bme280_data(&tracker_data.temp_value, &tracker_data.humidity_value, &tracker_data.gas_value);
#endif
#ifdef LIS3DH_TEST
		ret = lis3dh_twi_init();
		if(ret != NRF_SUCCESS) {
				DPRINTF(LOG_ERROR, "lis3dh_twi_init fail %d\r\n", ret);
		} else {
				get_lis3dh_data(&tracker_data.x, &tracker_data.y, &tracker_data.z);		
		}
#endif
#ifdef LIS2MDL_TEST
		ret = lis2mdl_twi_init();
		if(ret != NRF_SUCCESS) {
				DPRINTF(LOG_ERROR, "lis2mdl_twi_init fail %d\r\n", ret);
		} else {
				get_lis2mdl_data(&tracker_data.magnetic_x, &tracker_data.magnetic_y, &tracker_data.magnetic_z);
		}
#endif
#ifdef OPT3001_TEST
		ret = opt3001_twi_init();
		if(ret != NRF_SUCCESS) {
				DPRINTF(LOG_ERROR, "opt3001_twi_init fail %d\r\n", ret);
		} else {
				get_opt3001_data(&tracker_data.light_value);		
		}
#endif
		
