yogiD/RAK8212-itracker-firmware-based-on-nRF5SDK15.0.0-with-DFU/src/itracker/ble_peripheral/itracker/main.c
}

/**@brief timers.
 */
APP_TIMER_DEF(sensor_collect_timer);

char * float2str(float val, int precision, char *buf)
{
    char *cur, *end;
    
    sprintf(buf, "%.6f", val);
    if (precision < 6) {
        cur = buf + strlen(buf) - 1;
        end = cur - 6 + precision; 
        while ((cur > end) && (*cur == '0')) {
            *cur = '\0';
            cur--;
        }
    }
    
    return buf;
}

char * double2str(double val, int precision, char *buf)
{
    char *cur, *end;
    
    sprintf(buf, "%.6f", val);
    if (precision < 6) {
        cur = buf + strlen(buf) - 1;
        end = cur - 6 + precision; 
        while ((cur > end) && (*cur == '0')) {
            *cur = '\0';
            cur--;
        }
    }
    
    return buf;
}

char lati_buf[128];
char longi_buf[128];
uint8_t collect_flag = 0;

void sensor_collect_timer_handle()
{
		int ret;
		static uint32_t swi_cnt=0;
	
		start_collect_data();	

		sprintf(post_data, POST_FORMAT, tracker_data.temp_value,
																		tracker_data.humidity_value,
																		tracker_data.gas_value,
																		/*tracker_data.barometer_value,*/
																		tracker_data.light_value,
																		tracker_data.latitude,
																		tracker_data.longitude,
																		tracker_data.x,
																		tracker_data.y,
																		tracker_data.z,
																		tracker_data.magnetic_x,
																		tracker_data.magnetic_y,
																		tracker_data.magnetic_z
																		);
		DPRINTF(LOG_INFO, "%s", post_data);
/*
		swi_cnt++;
		if(swi_cnt==1)
		{
				DPRINTF(LOG_INFO, "uart switch to gps\n");
				//Gps_Uart_Init();
				//GpsGetLatestGpsPositionDouble(&tracker_data.latitude, &tracker_data.longitude);
				float2str((float)tracker_data.latitude, 2, lati_buf);
				float2str((float)tracker_data.longitude, 2, longi_buf);
				DPRINTF(LOG_INFO, "gps latitude=%s lontitude=%s\n", lati_buf, longi_buf);
		}
		else if(swi_cnt>=5)
		{
				swi_cnt = 0;
				if(gsm_started)
				{
						DPRINTF(LOG_INFO, "uart switch to gsm");
						Gsm_Uart_Init();
					
#if defined (M35)
						ret = Gsm_HttpPost(post_data, strlen(post_data));
						if (ret >0 ) 
						{
							 ret = Gsm_HttpRsp();
						}		
#endif
						int rssi=0;
						rssi= Gsm_GetRssiCmd();
						
						DPRINTF(LOG_INFO, "rssi=%d\r\n",rssi);
				}		
		}
*/
}

void _sensor_collect_timer_handle()
{
		collect_flag = 1;
}

uint32_t sensor_collect_timer_init(void)
{
    app_timer_create(&sensor_collect_timer,APP_TIMER_MODE_REPEATED,_sensor_collect_timer_handle);
		app_timer_start(sensor_collect_timer, 30000, NULL);
}

void sensors_init()
{
		int ret;
#ifdef BEM280_TEST
		ret = bme280_spi_init();
		if(ret != NRF_SUCCESS) {
				DPRINTF(LOG_ERROR, "bme280_spi_init fail %d\r\n", ret);
		} else {
				ret = _bme280_init();
				if(ret < 0) {
						DPRINTF(LOG_ERROR, "lis3dh_init fail\r\n");
				}
		}
#endif
#ifdef LIS3DH_TEST
		ret = lis3dh_twi_init();
		if(ret != NRF_SUCCESS) {
				DPRINTF(LOG_ERROR, "lis3dh_twi_init fail %d\r\n", ret);
		} else {
				ret = lis3dh_init();
				if(ret < 0) {
						DPRINTF(LOG_ERROR, "lis3dh_init fail\r\n");
				}
		}
#endif
#ifdef LIS2MDL_TEST
		ret = lis2mdl_twi_init();
		if(ret < 0) {
				DPRINTF(LOG_ERROR, "lis2mdl_twi_init fail %d\r\n", ret);
		} else {
				ret = lis2mdl_init();
				if(ret < 0) {
						DPRINTF(LOG_ERROR, "lis2mdl_init fail\r\n");
				}
		}
#endif
#ifdef OPT3001_TEST
		ret = opt3001_twi_init();
		if(ret < 0) {
				DPRINTF(LOG_ERROR, "opt3001_twi_init fail %d\r\n", ret);
		} else {
				ret = opt3001_init();
				if(ret < 0) {
						DPRINTF(LOG_ERROR, "opt3001_init fail\r\n");
				}
		}
#endif
}


/**@brief Application main function.
 */

int main(void)
{
    uint32_t err_code;
    bool erase_bonds;
		int ret;

    // Initialize.
    err_code = app_timer_init();
    APP_ERROR_CHECK(err_code);

    log_init();
    //buttons_leds_init(&erase_bonds);
    ble_stack_init();
    gap_params_init();
    gatt_init();
    services_init();
    advertising_init();
    conn_params_init();
		
		rtc_config();
		DPRINTF(LOG_INFO, "iTracker Start V1.0.0\r\n");
		// init gsm
		Gsm_Uart_Init();
		Gsm_Gpio_Init();
		Gsm_PowerUp();
		ret = GsmInit();
		if(ret == 0)
		{
				gsm_started = 1;
		}
		// init gps
		//GpsInit();
		// init sensors
		sensors_init();
		
		sensor_collect_timer_init();
		
    err_code = ble_advertising_start(&m_advertising, BLE_ADV_MODE_FAST);
    APP_ERROR_CHECK(err_code);

    // Enter main loop.
    for (;;)
    {
        power_manage();
			 
				//GSM post & sensors collect every 10s
				
				//GPS collect every 10s
			
				//sonsors every 10s
				if(collect_flag)
				{
						collect_flag = 0;
						sensor_collect_timer_handle();
				}
    }
}

/**
 * @}
 */
